<!doctype html>
<html>
    <head>
        <meta charset="utf-8">
        <title><?php echo $html_title; ?></title>
        <link href="css/install.css" rel="stylesheet" type="text/css">
        <link href="css/perfect-scrollbar.min.css" rel="stylesheet" type="text/css">
        <script type="text/javascript" src="js/jquery.js"></script>
        <script type="text/javascript" src="js/perfect-scrollbar.min.js"></script>
        <script type="text/javascript" src="js/jquery.mousewheel.js"></script>
    </head>
    <body>
        <?php echo $html_header; ?>
        <div class="main">
            <div class="text-box" id="text-box">
                <div class="license">
                    <h1>系统安装协议</h1>

                    <p>感谢您选择鲸发卡自动发卡平台系统（简称：鲸发卡），鲸发卡自动发卡平台系统是国内最稳定、最强大、最先进的发卡网站管理平台解决方案之一，鲸发卡基于 PHP + MySQL的技术，采用Thinkphp5框架开发，项目安装请参考`ThinkPHP`官方文档及下面的服务环境说明。</p>
                    <p>为了使你正确并合法的使用本软件，请你在使用前务必阅读清楚下面的协议条款：</p>
                    <p>本授权协议适用且仅适用于鲸发卡任何版本，鲸发卡官方对本授权协议的最终解释权和修改权。</p>
                    <p>承诺</p>
                    <p>您确认，在您成为我们的用户之前已充分阅读、理解并接受本协议的全部内容，一旦您使用本服务，即表示您同意遵循本协议之所有约定。
                        您同意，本公司有权随时对本协议内容进行单方面的变更，并以在本网站公告的方式予以公布，无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应停止使用本服务。

                    <p>一、协议许可的权利</p>
                    <p>1、您可以在完全遵守本最终用户授权协议的基础上，将本软件应用于非商业用途，本系统权限用于学习交流使用。</p>
                    <p>2、您可以在协议规定的约束和限制范围内修改 鲸发卡 源代码或界面风格以适应您的网站要求。</p>
                    <p>3、您拥有使用本软件构建的网站全部内容所有权，并独立承担与这些内容的相关法律义务。</p>
                    <p>4、获得商业授权之后，您可以将本软件应用于商业用途，同时依据所购买的授权类型中确定的技术支持内容。商业授权用户享有反映和提出意见的权力，相关意见将被作为首要考虑，但没有一定被采纳的承诺或保证。</p>

                    <p>二、协议许可的权利和限制</p>
                    <p>1、未获商业授权之前，不得删除网站底部及相应的官方版权信息和链接。解最新说明。</p>
                    <p>2、未经官方许可，不得对本软件或与之关联的商业授权进行出租、出售、抵押或发放子许可证。</p>
                    <p>3、不管你的网站是否整体使用 鲸发卡 ，还是部份栏目使用 鲸发卡，在你使用了 鲸发卡 的网站主页上必须加上 鲸发卡 官方网址(www.jingfaka.com)的链接。</p>
                    <p>4、未经官方许可，禁止在鲸发卡 的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。</p>
                    <p>5、如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。</p>

                    <p>三、有限担保和免责声明</p>
                    <p>1、本软件及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。</p>
                    <p>2、用户出于自愿而使用本软件，您必须了解使用本软件的风险，在尚未购买产品技术服务之前，我们不承诺对免费用户提供任何形式的技术支持、使用担保，也不承担任何因使用本软件而产生问题的相关责任。</p>
                    <p>3、电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始确认本协议并安装 鲸发卡，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</p>
                    <p>4. 您在使用本服务时应遵守中华人民共和国相关法律法规、您所在国家或地区之法令及相关国际惯例，不将本服务用于任何非法目的，也不以任何非法方式使用本服务。</p>
                    <p>5. 您不得利用本服务从事侵害他人合法权益之行为，否则本公司有权拒绝提供本服务，且您应承担所有相关法律责任，因此导致本公司或本公司用户受损的，您应承担赔偿责任。上述行为包括但不限于：</p>
                    <p>　　 (1)侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。</p>
                    <p>　　 (2)违反依法定或约定之保密义务。</p>
                    <p>　　 (3)违反《中华人民共和国刑法》、《中华人民共和国计算机信息系统安全保护条例》、《全国人民代表大会常务委员会关于维护互联网安全的决定》等等违法行为。</p>
                    <p>　　 (4)从事不法行为，如制作色情、赌博、病毒、挂马、反动、外挂、私服、钓鱼以及为私服提供任何服务(比如支付)的类似网站。</p>
                    <p>　 (5)提供赌博资讯或以任何方式引诱他人参与赌博。</p>
                    <p>　 (6)从事任何可能含有电脑病毒或是可能侵害本授权服务系统、诋毁本平台之行为。</p>

                    <p>四、使用须知和使用说明</p>
                    <p>1、购买本店所有提供的源码仅供贵方内部分析研究且应在国家法律条款范围内使用;</p>
                    <p>2、客户在使用源码以及数据后产生的后果由客户自行承担，我方概不负责;</p>
                    <p>3、使用鲸发卡后不得使用于非法用途，不得违反国家法律，否则后果自负！使用鲸发卡系统以后用作他用附带的一切法律责任后果都由购买者承担，与聊城蓝鲸网络科技有限公司员工以及法人无任何关系;</p>
                    <p></p>
                </div>
            </div>
            <div class="btn-box"><a href="index.php?step=1" class="btn btn-primary">同意协议进入安装</a><a href="javascript:window.close()" class="btn">不同意</a></div>
        </div>
        <?php echo $html_footer; ?>
        <script type="text/javascript">
            $(document).ready(function () {
                //自定义滚定条
                $('#text-box').perfectScrollbar();
            });
        </script>
    </body>
</html>
